"""Задача 1
Построение графиков в сервисе Yandex DataLens

Задание поможет закрепить навыки работы с сервисом Yandex DataLens
Для выполнения задания вам понадобится набор данных — информация
о пассажирах Титаника. На странице скачивания датасета
можно изучить описание данных

Что нужно сделать:
1.	Средствами Yandex DataLens построить сгруппированную
    полосовую диаграмму (grouped bar chart), отображающую распределение
    выживших пассажиров по классу кают, и, независимо, по полу.

2.	Настроить параметры диаграммы так, чтобы были выполнены условия:
    - на диаграмме имеется три группы (по классу каюты)
        по два столбика в каждом
    - оси (легенда) имеют подписи на русском языке
    - на диаграмме отсутствует сетка (разлинованный фон)
    - на каждом столбике подписано количество
        пассажиров (абсолютное значение)
    - столбики, отвечающие пассажирам мужского пола,
        даны в зеленом тоне, женского пола — в синем
    - у графика есть лаконичный заголовок на русском языке
    - график настроен на открытый доступ по ссылке

3.	В качестве решения задания прикрепите ссылку на построенный график"""


# Диаграмма доступна по ссылке: https://datalens.yandex/m00omehfbgme9
